InformationRegisters/ИА_АдресацияЗадачПланаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_АдресацияЗадачПланаДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_УведомленияКЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_УведомленияКЦ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ИА_ЗадачаПланаДействий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВидСобытия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ИА_ОбщиеПроцедуры_Технология_КоммЦентр/Ext/Module.bsl
Функция ПользовательНаПосту(Пользователь, пост) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_АдресацияЗадачПланаДействий.Пользователь
	               |ИЗ
	               |	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	               |ГДЕ
	               |	ИА_АдресацияЗадачПланаДействий.Пользователь = &Пользователь
	               |	И ИА_АдресацияЗадачПланаДействий.Пост = &Пост";
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	Запрос.УстановитьПараметр("Пост",Пост);
    Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка.Следующий();
КонецФункции

Процедура СоздатьУведомление(Задача, Пользователь, ВидСобытия, Текст) Экспорт
	мен = РегистрыСведений.ИА_УведомленияКЦ.СоздатьМенеджерЗаписи();
	мен.Период = ТекущаяДата();
	мен.ВидСобытия = ВидСобытия;
	мен.Задача = Задача;
	мен.Пользователь = Пользователь;
	мен.Текст = Текст;
	мен.Автор = ПараметрыСеанса.ТекущийПользователь;
	
	мен.Записать();
КонецПроцедуры


Функция ПолучитьМассивПостов(польз, ПостИерархии = Неопределено) Экспорт
	
	Если ПостИерархии = Неопределено Тогда
		пи = Справочники.ОргСхема.ПустаяСсылка();
	Иначе
		пи = ПостИерархии;
		Пока не пи.Родитель.Пустая() Цикл
			пи = пи.Родитель;
		КонецЦикла;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_АдресацияЗадачПланаДействий.Пост,
	               |	ИА_АдресацияЗадачПланаДействий.Пост.ТипТерминала.Порядок КАК Порядок
	               |ИЗ
	               |	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	               |ГДЕ
	               |	ИА_АдресацияЗадачПланаДействий.Пользователь = &Пользователь
	               |	И ИА_АдресацияЗадачПланаДействий.Пост.ПометкаУдаления = ЛОЖЬ
	               |	И ИА_АдресацияЗадачПланаДействий.Пост В ИЕРАРХИИ(&Пост)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_АдресацияЗадачПланаДействий.Пост.ТипТерминала.Порядок";
	Запрос.УстановитьПараметр("Пользователь", польз);
	Запрос.УстановитьПараметр("Пост", пи);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пост");
КонецФункции

Функция ПолучитьВысокийПостПользователя(польз, ПостИерархии = Неопределено) Экспорт
	м = ПолучитьМассивПостов(польз, ПостИерархии);
	
	Если м.Количество()>0 Тогда
		Возврат м[0];
	Иначе
		Возврат Справочники.ОргСхема.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции


// Взаимодействия
функция ПолучитьИДПользователя(польз)	
	идИБ = польз.ИдентификаторПользователяИБ;
	ид = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(идИБ);
	возврат ид;
КонецФункции

Процедура ДобавитьЗаписьВЗадачу(задача, текст, получатели = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(истина);
	
	навСсылка = ПолучитьНавигационнуюСсылку(задача);
	контекст = новый КонтекстОбсужденияСистемыВзаимодействия(навСсылка);
	менеджер = новый МенеджерСистемыВзаимодействия;
	
	Отбор = новый ОтборОбсужденийСистемыВзаимодействия;
	отбор.КонтекстноеОбсуждение = истина;
	отбор.КонтекстОбсуждения = контекст;
	
	Обсуждения = менеджер.ПолучитьОбсуждения(отбор);
	Если Обсуждения.Количество() = 0 Тогда
		обсуждение = менеджер.СоздатьОбсуждение();
		обсуждение.КонтекстОбсуждения = контекст;
		обсуждение.Ключ = строка(задача.УникальныйИдентификатор());
		обсуждение.Записать();
	Иначе
		обсуждение = Обсуждения[0];
	КонецЕсли;
	
	сообщение = менеджер.СоздатьСообщение(обсуждение.Идентификатор);
	//сообщение.Дата = дата;
	//сообщение.Автор = ПолучитьИДПользователя(автор);
	если получатели <> Неопределено Тогда
		Если ТипЗнч(получатели) = тип("Массив") Тогда
			Для каждого стр из получатели цикл
				сообщение.Получатели.Добавить(ПолучитьИДПользователя(стр));
			КонецЦикла;
		Иначе
			сообщение.Получатели.Добавить(ПолучитьИДПользователя(получатели));
		КонецЕсли;
	КонецЕсли;
	сообщение.Текст = новый ФорматированнаяСтрока(текст);
	сообщение.Записать();
	
	УстановитьПривилегированныйРежим(ложь);
	
КонецПроцедуры

Функция ПолучитьТЗСообщенийОбсужденийзадачи(задача, СоотвИД = Неопределено) Экспорт
	ход = Задачи.ИА_ЗадачаПланаДействий.ПустаяСсылка().ХодВыполнения.Выгрузить();
			
	навСсылка = ПолучитьНавигационнуюСсылку(задача);
	контекст = новый КонтекстОбсужденияСистемыВзаимодействия(навСсылка);
	менеджер = новый МенеджерСистемыВзаимодействия;
	
	Отбор = новый ОтборОбсужденийСистемыВзаимодействия;
	отбор.КонтекстноеОбсуждение = истина;
	отбор.КонтекстОбсуждения = контекст;
	
	Попытка
		Обсуждения = менеджер.ПолучитьОбсуждения(отбор);
	Исключение
		сообщить(ОписаниеОшибки());
		возврат Неопределено;
	КонецПопытки;
	
	если Обсуждения.Количество()>0 Тогда
		обсуждение = Обсуждения[0];
		отборСообщ = Новый ОтборСообщенийСистемыВзаимодействия;
		отборСообщ.Обсуждение = обсуждение.Идентификатор;
		Сообщения = менеджер.ПолучитьСообщения(отборСообщ);
		для каждого стрОбс из Сообщения Цикл
			Если СоотвИД <> Неопределено Тогда
				авторСообщИД = СоотвИД.Получить(стрОбс.Автор);
				Если авторСообщИД = Неопределено Тогда
					авторСообщИД = менеджер.ПолучитьИдентификаторПользователяИнформационнойБазы(стрОбс.Автор);
					СоотвИД.Вставить(стрОбс.Автор, авторСообщИД);
				КонецЕсли;
			Иначе
				авторСообщИД = менеджер.ПолучитьИдентификаторПользователяИнформационнойБазы(стрОбс.Автор);
			КонецЕсли;
			
			выбПольз = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",авторСообщИД);
			новстр = ход.добавить();
			новстр.Дата = стрОбс.Дата;
			новстр.Пользователь = выбПольз;
			новстр.Комментарий = строка(стрОбс.Текст);
		КонецЦикла;
	КонецЕсли;
	
	возврат ход;
КонецФункции
